Study2/src/Catalogs/Филиалы/Филиалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Филиалы</name>
  <attributes>
    <name>Город</name>
    <type>
      <types>CatalogRef.Города</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидФилиала</name>
    <type>
      <types>EnumRef.ВидыФилиалов</types>
    </type>
  </attributes>
</mdclass:Catalog>

Study2/src/Enums/ВидыФилиалов/ВидыФилиалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыФилиалов</name>
  <enumValues>
    <name>Магазин</name>
  </enumValues>
  <enumValues>
    <name>Администрация</name>
  </enumValues>
  <enumValues>
    <name>Склад</name>
  </enumValues>
  <enumValues>
    <name>СЦ</name>
  </enumValues>
</mdclass:Enum>

Study2/src/Catalogs/Кассы/Кассы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Кассы</name>
  <owners>Catalog.Филиалы</owners>
  <attributes>
    <name>МодельКассы</name>
    <type>
      <types>EnumRef.МоделиКасс</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрЛицо</name>
    <type>
      <types>CatalogRef.ЮридическиеЛица</types>
    </type>
  </attributes>
</mdclass:Catalog>

Study2/src/Catalogs/Филиалы/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Перем ОтветПередЗаписью;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если (Объект.ВидФилиала = Перечисления.ВидыФилиалов.Администрация) Тогда
		Сообщить("Вам запрещено открывать администрации!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	ОбновитьСписокКассФилиала();
	
	ЭтотОбъект.Заголовок = СтрШаблон("%1 (%2)", Объект.Наименование, Объект.ВидФилиала);
	
	Если Параметры.ЦветАдреса = 1 Тогда
		Элементы.Адрес.ЦветФона = WebЦвета.Синий;
	ИначеЕсли Параметры.ЦветАдреса = 2 Тогда
		Элементы.Адрес.ЦветФона = WebЦвета.Красный; 
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВидФилиалаПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если (НЕ ЗначениеЗаполнено(Объект.ДатаОткрытия) И ОтветПередЗаписью <>
		Истина) Тогда
		Отказ = Истина;
		Оповещение = Новый ОписаниеОповещения("ПередЗаписьюПродолжить", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, "Не заполнена дата открытия. Продолжить?",
		РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписьюПродолжить(РезультатВопроса, ДополнительныеПараметры) Экспорт 
	
	Если (РезультатВопроса = КодВозвратаДиалога.Да) Тогда
		ОтветПередЗаписью = Истина;
		ЭтотОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидФилиалаПриИзменении(Элемент)
	
	Если (Объект.ВидФилиала =
		ПредопределенноеЗначение("Перечисление.ВидыФилиалов.Склад")) Тогда
		Элементы.Наименование.ЦветФона = WebЦвета.Роса;		
	ИначеЕсли (Объект.ВидФилиала =
		ПредопределенноеЗначение("Перечисление.ВидыФилиалов.СЦ")) Тогда 	 
		Элементы.Наименование.ЦветФона = WebЦвета.Лазурный;		
	ИначеЕсли (Объект.ВидФилиала =
		ПредопределенноеЗначение("Перечисление.ВидыФилиалов.Магазин")) Тогда    
		Элементы.Наименование.ЦветФона = WebЦвета.БледноМиндальный;	
	Иначе 
		Элементы.Наименование.ЦветФона = WebЦвета.Белый;			
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокСкладовФилиала()
	
	Если (НЕ Параметры.Ключ.Пустая()) Тогда
		ВыборкаИзСправочника = Справочники.Склады.Выбрать(, Объект.Ссылка);
		Пока ВыборкаИзСправочника.Следующий() Цикл 
			НоваяСтрока = СкладыФилиала.Добавить();
			НоваяСтрока.Склад = ВыборкаИзСправочника.Ссылка; 
			НоваяСтрока.ТипСклада = ВыборкаИзСправочника.ТипСклада; 
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ОбновитьСписокКассФилиала()
	
	Если (НЕ Параметры.Ключ.Пустая()) Тогда
		ВыборкаИзСправочника = Справочники.Кассы.Выбрать(, Объект.Ссылка);
		Пока ВыборкаИзСправочника.Следующий() Цикл 
			НоваяСтрока = КассыФилиала.Добавить();
			НоваяСтрока.Касса = ВыборкаИзСправочника.МодельКассы; 
			НоваяСтрока.ЮрЛицо = ВыборкаИзСправочника.ЮрЛицо; 
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
